# name:   inchi_roundtrip.org
# author: nbehrnd@yahoo.com
# date:   <2022-01-29 Sat>
# edit:   <2022-01-30 Sun>

** still missing parts

   + given a SMILES string, generate a .sdf with OpenBabel

     #+begin_src python :tangle no :output both :results output replace
from openbabel import pybel

mol = pybel.readstring("smi", "CCl")
mol.make3D()
print(mol.write("sdf"))

with open("test_file_ob.sdf", mode="w") as newfile:
    newfile.write(mol.write("sdf"))
     #+end_src

     #+RESULTS:
     #+begin_example

      OpenBabel01302220013D

       5  4  0  0  0  0  0  0  0  0999 V2000
         0.9519    0.0593   -0.0623 C   0  0  0  0  0  0  0  0  0  0  0  0
         2.7188    0.0593   -0.0623 Cl  0  0  0  0  0  0  0  0  0  0  0  0
         0.5948    1.0541   -0.3379 H   0  0  0  0  0  0  0  0  0  0  0  0
         0.5948   -0.1994    0.9369 H   0  0  0  0  0  0  0  0  0  0  0  0
         0.5948   -0.6767   -0.7860 H   0  0  0  0  0  0  0  0  0  0  0  0
       1  2  1  0  0  0  0
       1  3  1  0  0  0  0
       1  4  1  0  0  0  0
       1  5  1  0  0  0  0
     M  END
     $$$$

     #+end_example

   + a control of the above:

     #+begin_src bash :tangle no :output both :results output replace
echo "Check the .sdf generated:"
cat test_file_ob.sdf
     #+end_src

     #+RESULTS:
     #+begin_example
     Check the .sdf generated:

      OpenBabel01302220013D

       5  4  0  0  0  0  0  0  0  0999 V2000
         0.9519    0.0593   -0.0623 C   0  0  0  0  0  0  0  0  0  0  0  0
         2.7188    0.0593   -0.0623 Cl  0  0  0  0  0  0  0  0  0  0  0  0
         0.5948    1.0541   -0.3379 H   0  0  0  0  0  0  0  0  0  0  0  0
         0.5948   -0.1994    0.9369 H   0  0  0  0  0  0  0  0  0  0  0  0
         0.5948   -0.6767   -0.7860 H   0  0  0  0  0  0  0  0  0  0  0  0
       1  2  1  0  0  0  0
       1  3  1  0  0  0  0
       1  4  1  0  0  0  0
       1  5  1  0  0  0  0
     M  END
     $$$$
     #+end_example

   + assign a smiles from a .sdf by OpenBabel

     #+begin_src python :tangle no :output both :results output replace
from openbabel import pybel

for mymol in pybel.readfile("sdf", "test_file_ob.sdf"):
    print(mymol.write("smi"))
     #+end_src

     #+RESULTS:
     : CCl	
     : 

   + generate a .sdf from SMILES, rdkit

     #+begin_src python :tangle no :output both :results output replace
import rdkit
from rdkit import Chem
from rdkit.Chem import AllChem

mol = Chem.MolFromSmiles("CF")
with_hydrogens = Chem.AddHs(mol)
AllChem.EmbedMolecule(with_hydrogens,randomSeed=0xf00d) 
print(Chem.MolToMolBlock(with_hydrogens))

with open("test_file_rd.sdf", mode="w") as newfile:
    newfile.write(Chem.MolToMolBlock(with_hydrogens))
     #+end_src

     #+RESULTS:
     #+begin_example

          RDKit          3D

       5  4  0  0  0  0  0  0  0  0999 V2000
        -0.0524   -0.0120    0.0160 C   0  0  0  0  0  0  0  0  0  0  0  0
         1.3238   -0.1464   -0.1423 F   0  0  0  0  0  0  0  0  0  0  0  0
        -0.3175    0.0493    1.0931 H   0  0  0  0  0  0  0  0  0  0  0  0
        -0.3465    0.9303   -0.4647 H   0  0  0  0  0  0  0  0  0  0  0  0
        -0.6073   -0.8212   -0.5021 H   0  0  0  0  0  0  0  0  0  0  0  0
       1  2  1  0
       1  3  1  0
       1  4  1  0
       1  5  1  0
     M  END

     #+end_example

   + check of the above

     #+begin_src bash :tangle no :output both :results output replace
cat test_file_rd.sdf
     #+end_src

     #+RESULTS:
     #+begin_example

          RDKit          3D

       5  4  0  0  0  0  0  0  0  0999 V2000
        -0.0524   -0.0120    0.0160 C   0  0  0  0  0  0  0  0  0  0  0  0
         1.3238   -0.1464   -0.1423 F   0  0  0  0  0  0  0  0  0  0  0  0
        -0.3175    0.0493    1.0931 H   0  0  0  0  0  0  0  0  0  0  0  0
        -0.3465    0.9303   -0.4647 H   0  0  0  0  0  0  0  0  0  0  0  0
        -0.6073   -0.8212   -0.5021 H   0  0  0  0  0  0  0  0  0  0  0  0
       1  2  1  0
       1  3  1  0
       1  4  1  0
       1  5  1  0
     M  END
     #+end_example

   + assign SMILES from .sdf by RDKit

     #+begin_src python :tangle no :output both :results output replace
import rdkit
from rdkit import Chem
   
m = Chem.MolFromMolFile('test_file_rd.sdf')
print(Chem.MolToSmiles(m,isomericSmiles=False))

     #+end_src

     #+RESULTS:
     : CF

